package gocrud

const (

	// ERROR MESSAGES
	InternalServerError      = "خطای داخلی سرور"
	InvalidJsonBody          = "بدنه ی درخواست معتبر نیست"
	InvalidRequest           = "درخواست شما معتبر نیست"
	CreateError              = "در ایجاد ایتم مورد نظر خطایی رخ داد"
	DeleteError              = "در حذف ایتم مورد نظر خطایی رخ داد"
	NoDataFound              = "داده ای یافت نشد"
	BadPerson                = "ای ناقلا 🤡🤡🤡 این کارا چیه؟"
	IncorrectOTP             = "کد احراز هویت اشتباه می باشد"
	InvalidToken             = "توکن نامعتبر است"
	PermissionNotAllowed     = "شما به این قسمت دسترسی ندارید"
	UploadError              = "خطا در آپلود فایل"
	UpdateError              = "خطایی در بروزرسانی داده رخ داد"
	UpdateDoneButImageFailed = "بروزرسانی اطلاعات با موفقیت انجام شد ولی اپلود تصویر با مشکل مواجه شد"
	DataNotUnique            = "داده ای با این مشخصات وجود دارد"
	ImageNotFound            = "تصویری یافت نشد"

	//
	Success           = "عملیات موفقیت آمیز"
	SendingOTP        = "کد احراز هویت با موفقیت ارسال شد"
	Wait2Minutes      = "لطفا 2 دقیقه دیگر امتحان کنید"
	EmptyCart         = "سبد خرید خالی است"
	ProductOutOfStock = "محصول موجود نمی باشد"
	Friend            = "دوست"
)
